---
kind: method
id: M:Autodesk.Revit.UI.Events.RibbonItemEventArgs.#ctor
source: html/16076c8c-a9fd-51f0-74d5-ea07078ddf2b.htm
---
# Autodesk.Revit.UI.Events.RibbonItemEventArgs.#ctor Method

Initializes a new instance of the RibbonItemEventArgs class

## Syntax (C#)
```csharp
public RibbonItemEventArgs()
```